12/data/attachments/627d3f23782d2d4e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3754447f-dfc3-47cd-b37d-4449d64219da</nif:username>
            <nif:friendToBeAdded>Katherine_once_Friend_74959_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>